# Напишите программу, которая принимает произвольное количество строк и в каждой введенной строке располагает
# все символы в обратном порядке.
#
# Формат входных данных
# На вход программе подается произвольное количество строк.
#
# Формат выходных данных
# Программа должна вывести все введенные строки,
# предварительно расположив в каждой строке все символы в обратном порядке.
#
# Примечание 1. Порядок вывода строк должен совпадать с порядком их ввода.
#
# Примечание 2. Если на вход программе ничего не подается, то она ничего не должна выводить.

import sys

for line_in in sys.stdin:
    sys.stdout.write(line_in[-1::-1])
